{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Магический квадрат 🌶️\n",
    "Магическим квадратом порядка n называется квадратная таблица размера  n×n, составленная из всех чисел \n",
    "1,2,3,…,n \n",
    "  (то есть все числа разные) так, что суммы по каждому столбцу, каждой строке и каждой из двух диагоналей равны между собой. Напишите программу, которая проверяет, является ли заданная квадратная матрица магическим квадратом.\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подаётся натуральное число \n",
    "n — количество строк и столбцов в матрице, затем элементы матрицы: \n",
    "n строк, по n чисел в каждой, разделённые пробелами.\n",
    "Формат выходных данных\n",
    "Программа должна вывести слово YES, если матрица является магическим квадратом, и слово NO в противном случае.\n",
    "3\n",
    "8 1 6\n",
    "3 5 7   YES\n",
    "4 9 2 \n",
    "3\n",
    "8 2 6\n",
    "3 5 7  NO\n",
    "4 9 1\n",
    "3\n",
    "4 9 2\n",
    "3 5 7  YES\n",
    "8 1 6\n",
    "6\n",
    "27 29 2 4 13 36\n",
    "9 11 20 22 31 18\n",
    "32 25 7 3 21 23\n",
    "14 16 34 30 12 5 YES\n",
    "28 6 15 17 26 19\n",
    "1 24 33 35 8 10\n",
    "4\n",
    "16 3 2 13\n",
    "5 10 11 8\n",
    "9 6 7 12  YES\n",
    "4 15 14 1\n",
    "6\n",
    "27 29 2 4 13 36\n",
    "9 11 20 22 31 18\n",
    "32 25 7 3 21 23\n",
    "14 16 34 30 12 5   NO\n",
    "28 6 15 17 26 19\n",
    "1 24 33 35 10 8\n",
    "3\n",
    "6 2 6\n",
    "3 5 3 NO\n",
    "6 8 2\n",
    "3\n",
    "5 5 5\n",
    "5 5 5 NO\n",
    "5 5 5\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "n,m = input()\n",
    "y = 'abcdefgh'.find(n) \n",
    "x = int(m)\n",
    "n = 8\n",
    "matrix = ['.' * 8 for _ in range(n)]\n",
    "print(matrix)\n",
    "#matrix[x][y] = 'N'\n",
    "matrix[x + 2][y + 1] = '*'\n",
    "matrix[x + 2][y - 1] = '*'\n",
    "matrix[x + 1][y + 2] = '*'\n",
    "matrix[x - 1][y + 2] = '*'\n",
    "matrix[x - 2][y + 1] = '*'\n",
    "matrix[x - 2][y - 1] = '*'\n",
    "matrix[x - 1][y + 2] = '*'\n",
    "matrix[x + 1][y - 2] = '*'\n",
    "for i in range(n):\n",
    "    print(matrix[i], end = ' ')\n",
    "print()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "name": "python",
   "version": "3.12.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
