{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "10.1 Словарь программиста\n",
    "Программисты, как вы уже знаете, постоянно учатся, а в общении между собой используют весьма специфический язык. Чтобы систематизировать ваш пополняющийся профессиональный лексикон, мы придумали эту задачу. Напишите программу создания небольшого словаря сленговых программерских выражений, чтобы она потом по запросу возвращала значения из этого словаря.\n",
    "Формат входных данных\n",
    "В первой строке задано одно целое число \n",
    "n — количество слов в словаре. В следующих \n",
    "n строках записаны слова и их определения, разделенные двоеточием и символом пробела. В следующей строке записано целое число \n",
    "m — количество поисковых слов, чье определение нужно вывести. В следующих \n",
    "m строках записаны сами слова, по одному на строке.\n",
    "Формат выходных данных\n",
    "Для каждого слова, независимо от регистра символов, если оно присутствует в словаре, необходимо вывести его определение. Если слова в словаре нет, программа должна вывести \"Не найдено\", без кавычек.\n",
    "Примечание 2. Гарантируется, что в определяемом слове или фразе отсутствует двоеточие (:), следом за которым идёт пробел.\n",
    "пример:\n",
    "\t7\n",
    "Бэкенд: программно-аппаратная или серверная часть приложения\n",
    "Бэкап: резервная копия или процесс создания резервной копии приложения\n",
    "Галера: компания, в которой платят низкие зарплаты и не ценят разработчиков\n",
    "Гит: система контроля версий Git или сервис GitHub\n",
    "Г***окод: плохой, некачественный код\n",
    "Жаба: язык программирования Java\n",
    "Жабаскрипт: язык программирования JavaScript\n",
    "6\n",
    "Жаба\n",
    "Змея\n",
    "Костыль\n",
    "Бета\n",
    "БЭКЕНД\n",
    "Г***окод\tязык программирования Java\n",
    "Не найдено\n",
    "Не найдено\n",
    "Не найдено\n",
    "программно-аппаратная или серверная часть приложения\n",
    "плохой, некачественный код"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "n = int(input())\n",
    "dicts = []\n",
    "fraza = []\n",
    "for i in range(n):\n",
    "    fraza = input().split(':')\n",
    "    for i in fraza:\n",
    "        fraza1 = fraza[0].lower()\n",
    "        fraza[0] = fraza1\n",
    "    dicts.append(fraza)    \n",
    "dicts = dict(dicts)\n",
    "m = int(input())   \n",
    "for i in range(m):\n",
    "    zapros = input()\n",
    "    #print(zapros)\n",
    "    print(dicts.get(zapros.lower(),'Не найдено').lstrip())"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "name": "python",
   "version": "3.12.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
