{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "10.6 Телефонная книга\n",
    "Тимур записал телефоны всех своих друзей, чтобы автоматизировать поиск нужного номера.\n",
    "\n",
    "У каждого из друзей Тимура может быть один или более телефонных номеров. Напишите программу, которая поможет Тимуру находить все номера определённого друга.\n",
    "\n",
    "Формат входных данных\n",
    "В первой строке задано одно целое число \n",
    "n — количество номеров телефонов, информацию о которых Тимур сохранил в телефонной книге. В следующих \n",
    "n строках заданы телефоны и имена их владельцев через пробел. В следующей строке записано целое число \n",
    "m — количество поисковых запросов от Тимура. В следующих \n",
    "m строках записаны сами запросы, по одному на строке. Каждый запрос — это имя друга, чьи телефоны Тимур хочет найти.\n",
    "\n",
    "Формат выходных данных\n",
    "Для каждого запроса от Тимура выведите в отдельной строке все телефоны, принадлежащие человеку с этим именем (независимо от регистра имени). Если в телефонной книге нет телефонов человека с таким именем, выведите в соответствующей строке «абонент не найден» (без кавычек).\n",
    "\n",
    "Примечание 1. Телефоны одного человека выводите в одну строку через пробел в том порядке, в каком они были заданы во входных данных.\n",
    "\n",
    "Примечание 2. Количество строк в ответе должно быть равно числу \n",
    "m.\n",
    "\n",
    "Примечание 3. Телефон — это несколько цифр, записанных подряд, а имя может состоять из букв русского или английского алфавита. Записи не повторяются.\n",
    "Номер теста\tВходные данные\tВыходные данные\n",
    "2\n",
    "889906425189 Sofia\n",
    "5637632595 Anna\n",
    "3\n",
    "Anna\n",
    "Sofia\n",
    "Jack\n",
    "\n",
    "5637632595\n",
    "889906425189\n",
    "абонент не найден\n",
    "\n",
    "3\n",
    "79184219577 Женя\n",
    "79194249271 Руслан\n",
    "79281234567 Женя\n",
    "3\n",
    "Руслан\n",
    "женя\n",
    "Рустам"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "dicts1= [['Женя', '79281234567'], ['Руслан', '79194249271'], ['Женя', '79184219577']]\n",
      "{'Женя': '79281234567'}\n",
      "{'Женя': '79281234567', 'Руслан': '79194249271'}\n",
      "{'Женя': '79281234567 79184219577', 'Руслан': '79194249271'}\n"
     ]
    }
   ],
   "source": [
    "def funck(x):\n",
    "    dicts =[]\n",
    "    state = x[0]\n",
    "    town = x[1]\n",
    "    dicts.append(town )\n",
    "    dicts.append(state )\n",
    "    return dicts\n",
    "n = int(input())\n",
    "dicts1 = []\n",
    "for i in range(n):\n",
    "    dicts2 = []\n",
    "    state = input().split(' ')  \n",
    "    dicts2 = funck(state)  \n",
    "    dicts1.append(dicts2)\n",
    "#print('dicts1=', dicts1)\n",
    "dicts3 = {}\n",
    "for i in range(len(dicts1)):    \n",
    "    if dicts1[i][0] not in dicts3:\n",
    "        dicts3[dicts1[i][0]] = dicts1[i][1]\n",
    "    else:\n",
    "        dicts3[dicts1[i][0]] = (dicts3[dicts1[i][0]] + ' ' + (dicts1[i][1]))\n",
    "m = int(input())\n",
    "#print(m)\n",
    "for j in range(m):\n",
    "    key = input().title()    \n",
    "    print(dicts1.get(key,'абонент не найден' ))   \n",
    "\n",
    "    \n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
